problem_sets/cfd_suite/Exeter_CFD_Problems/data/TJunction/case_T/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//           outlet1
//             +-+
//             | |
//             | |
//             | |
//             | |
// +-----------+ |
// |inlet        |
// +-----------+ |
//             | |
//             | |
//             | |
//             | |
//             +-+
//           outlet2

convertToMeters 1;

vertices
(
    (-0.2  -0.075 0)   //0
    (0.165 -0.075 0)   //1 edge of lower pipe (
    (0.1   0.075 0)   //2 CHANGE X value!
    (-0.2   0.075 0)
    (0.295 -0.075 0)  //4
    (0.295  0.075 0)
    (0.165  -0.75 0)  //6
    (0.295 -0.75 0)
    (0.1  0.75 0)  //8 CHANGE X value - the same!
    (0.295 0.75 0)

    // Z
    (-0.2 -0.075 0.001)   //10
    (0.165  -0.075 0.001)   // 11 edge of lower pipe
    (0.1   0.075 0.001)   //12 CHANGE X value!
    (-0.2   0.075 0.001)
    (0.295 -0.075 0.001)  //14
    (0.295  0.075 0.001)
    (0.165  -0.75 0.001)  //16 
    (0.295 -0.75 0.001)
    (0.1   0.75 0.001)  //18 CHANGE X value - the same!
    (0.295  0.75 0.001)
    (0.1  -0.075 0)   //20 CHANGE X value! - extra points
    (0.1  -0.075 0.001)   //21 CHANGE X value! - extra points
    (0.165  0.075 0)   //22 midpoint of upper pipe
    (0.165  0.075 0.001)   //23 midpoint of upper pipe

    (-0.2 0 0)   //24 midpoint of upper pipe
    (0.1 0 0) 
    (0.165 0 0)     
    (0.295 0 0)   

    (-0.2 0 0.001)   //28 midpoint of upper pipe
    (0.1 0 0.001) 
    (0.165 0 0.001)     
    (0.295 0 0.001) 
);

blocks
(
    // inlet1 block
    hex (0 20 25 24  10 21 29 28) (125 37 1) simpleGrading (1 1 1)

    // inlet2 block
    hex (24 25 2 3  28 29 12 13) (125 37 1) simpleGrading (1 1 1)

    // central block1
    hex (20 1 26 25  21 11 30 29) (25 37 1) simpleGrading (1 1 1)

    // central block2
    hex (1 4 27 26  11 14 31 30) (50 37 1) simpleGrading (1 1 1)

    // central block3
    hex (25 27 5 2  29 31 15 12) (75 37 1) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (50 317 1) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (75 317 1) simpleGrading (1 1 1)
);

/*    // inlet1 block
    hex (0 20 25 24  10 21 29 28) (45 13 1) simpleGrading (1 1 1)

    // inlet2 block
    hex (24 25 2 3  28 29 12 13) (45 13 1) simpleGrading (1 1 1)

    // central block1
    hex (20 1 26 25  21 11 30 29) (9 13 1) simpleGrading (1 1 1)

    // central block2
    hex (1 4 27 26  11 14 31 30) (18 13 1) simpleGrading (1 1 1)

    // central block3
    hex (25 27 5 2  29 31 15 12) (27 13 1) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (18 153 1) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (27 153 1) simpleGrading (1 1 1)*/

/*
    // inlet1 block
    hex (0 20 25 24  10 21 29 28) (125 37 1) simpleGrading (1 1 1)

    // inlet2 block
    hex (24 25 2 3  28 29 12 13) (125 37 1) simpleGrading (1 1 1)

    // central block1
    hex (20 1 26 25  21 11 30 29) (25 37 1) simpleGrading (1 1 1)

    // central block2
    hex (1 4 27 26  11 14 31 30) (50 37 1) simpleGrading (1 1 1)

    // central block3
    hex (25 27 5 2  29 31 15 12) (75 37 1) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (50 423 1) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (75 423 1) simpleGrading (1 1 1)
*/

/*
    // inlet1 block
    hex (0 20 25 24  10 21 29 28) (150 45 1) simpleGrading (1 1 1)

    // inlet2 block
    hex (24 25 2 3  28 29 12 13) (150 45 1) simpleGrading (1 1 1)

    // central block1
    hex (20 1 26 25  21 11 30 29) (30 45 1) simpleGrading (1 1 1)

    // central block2
    hex (1 4 27 26  11 14 31 30) (60 45 1) simpleGrading (1 1 1)

    // central block3
    hex (25 27 5 2  29 31 15 12) (90 45 1) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (60 200 1) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (90 200 1) simpleGrading (1 1 1)
*/
edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 28 24)
            (24 28 13 3)
        );
    }

    outlet1
    {
        type patch;
        faces
        (
            (6 7 17 16)
        );
    }

    outlet2
    {
        type patch;
        faces
        (
            (8 18 19 9)
        );
    }

    lowerWall
    {
        type wall;
        faces 
         (
           (0 10 21 20)//inlet
           (3 2 12 13)
           (6 1 11 16) //outlet1
           (7 4 14 17)
           (2 8 18 12) //outlet2
           (5 9 19 15)
           (4 27 31 14) //center
           (27 5 15 31)
           (20 1 11 21)
         );
    }
    frontAndBack
    {
        type empty;
        faces 
         (
           (0 24 25 20)//inlet1
           (10 28 29 21)
           (24 3 2 25) //inlet2
           (28 13 12 29)
           (21 11 30 29)//centretop1 
           (11 14 31 30) //centretop2
           (29 31 15 12) //centretop3
           (20 1 26 25) //centrebottom1
           (1 4 27 26) //centrebottom2
           (25 27 5 2) //centrebottom3
           (12 15 19 18)//outlet1
           (2 5 9 8)
           (16 17 14 11) //outlet2
           (6 7 4 1)
         );
    }

    empty_patch1
    {
        type empty;
        faces 
        (
         (25 26 30 29)
         (26 27 31 30)
        );
    }

   defaultFaces
    {
        type empty;
        faces 
           ();
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
